grevaillot/svd_tools/headers/STM32H7x5_CM4/sdmmc2.h
/** SDMMC2_DCTRL_DTDIR Data transfer direction selection This bit can only be written by firmware when DPSM is inactive (DPSMACT = 0). **/
#define SDMMC2_DCTRL_DTDIR		(1 << 1)
/** SDMMC2_DCTRL_DTEN Data transfer enable bit This bit can only be written by firmware when DPSM is inactive (DPSMACT = 0). This bit is cleared by Hardware when data transfer completes. This bit shall only be used to transfer data when no associated data transfer command is used, i.e. shall not be used with SD or eMMC cards. **/
#define SDMMC2_DCTRL_DTEN		(1 << 0)

/**@}*/

/** @defgroup sdmmc2_dcntr DCNTR The SDMMC_DCNTR register loads the value from the data length register (see SDMMC_DLENR) when the DPSM moves from the Idle state to the Wait_R or Wait_S state. As data is transferred, the counter decrements the value until it reaches 0. The DPSM then moves to the Idle state and when there has been no error, the data status end flag (DATAEND) is set.
@{*/


#define SDMMC2_DCNTR_DATACOUNT_SHIFT		0
#define SDMMC2_DCNTR_DATACOUNT_MASK		0x1ffffff
/** @defgroup sdmmc2_dcntr_datacount DATACOUNT Data count value When read, the number of remaining data bytes to be transferred is returned. Write has no effect.
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc2_star STAR The SDMMC_STAR register is a read-only register. It contains two types of flag:Static flags (bits [29,21,11:0]): these bits remain asserted until they are cleared by writing to the SDMMC interrupt Clear register (see SDMMC_ICR)Dynamic flags (bits [20:12]): these bits change state depending on the state of the underlying logic (for example, FIFO full and empty flags are asserted and de-asserted as data while written to the FIFO)
@{*/

/** SDMMC2_STAR_IDMABTC IDMA buffer transfer complete. interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_IDMABTC		(1 << 28)
/** SDMMC2_STAR_IDMATE IDMA transfer error. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_IDMATE		(1 << 27)
/** SDMMC2_STAR_CKSTOP SDMMC_CK stopped in Voltage switch procedure. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_CKSTOP		(1 << 26)
/** SDMMC2_STAR_VSWEND Voltage switch critical timing section completion. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_VSWEND		(1 << 25)
/** SDMMC2_STAR_ACKTIMEOUT Boot acknowledgment timeout. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_ACKTIMEOUT		(1 << 24)
/** SDMMC2_STAR_ACKFAIL Boot acknowledgment received (boot acknowledgment check fail). Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_ACKFAIL		(1 << 23)
/** SDMMC2_STAR_SDIOIT SDIO interrupt received. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_SDIOIT		(1 << 22)
/** SDMMC2_STAR_BUSYD0END end of SDMMC_D0 Busy following a CMD response detected. This indicates only end of busy following a CMD response. This bit does not signal busy due to data transfer. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_BUSYD0END		(1 << 21)
/** SDMMC2_STAR_BUSYD0 Inverted value of SDMMC_D0 line (Busy), sampled at the end of a CMD response and a second time 2 SDMMC_CK cycles after the CMD response. This bit is reset to not busy when the SDMMCD0 line changes from busy to not busy. This bit does not signal busy due to data transfer. This is a hardware status flag only, it does not generate an interrupt. **/
#define SDMMC2_STAR_BUSYD0		(1 << 20)
/** SDMMC2_STAR_RXFIFOE Receive FIFO empty This is a hardware status flag only, does not generate an interrupt. This bit is cleared when one FIFO location becomes full. **/
#define SDMMC2_STAR_RXFIFOE		(1 << 19)
/** SDMMC2_STAR_TXFIFOE Transmit FIFO empty This bit is cleared when one FIFO location becomes full. **/
#define SDMMC2_STAR_TXFIFOE		(1 << 18)
/** SDMMC2_STAR_RXFIFOF Receive FIFO full This bit is cleared when one FIFO location becomes empty. **/
#define SDMMC2_STAR_RXFIFOF		(1 << 17)
/** SDMMC2_STAR_TXFIFOF Transmit FIFO full This is a hardware status flag only, does not generate an interrupt. This bit is cleared when one FIFO location becomes empty. **/
#define SDMMC2_STAR_TXFIFOF		(1 << 16)
/** SDMMC2_STAR_RXFIFOHF Receive FIFO half full There are at least half the number of words in the FIFO. This bit is cleared when the FIFO becomes half+1 empty. **/
#define SDMMC2_STAR_RXFIFOHF		(1 << 15)
/** SDMMC2_STAR_TXFIFOHE Transmit FIFO half empty At least half the number of words can be written into the FIFO. This bit is cleared when the FIFO becomes half+1 full. **/
#define SDMMC2_STAR_TXFIFOHE		(1 << 14)
/** SDMMC2_STAR_CPSMACT Command path state machine active, i.e. not in Idle state. This is a hardware status flag only, does not generate an interrupt. **/
#define SDMMC2_STAR_CPSMACT		(1 << 13)
/** SDMMC2_STAR_DPSMACT Data path state machine active, i.e. not in Idle state. This is a hardware status flag only, does not generate an interrupt. **/
#define SDMMC2_STAR_DPSMACT		(1 << 12)
/** SDMMC2_STAR_DABORT Data transfer aborted by CMD12. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_DABORT		(1 << 11)
/** SDMMC2_STAR_DBCKEND Data block sent/received. (CRC check passed) and DPSM moves to the READWAIT state. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_DBCKEND		(1 << 10)
/** SDMMC2_STAR_DHOLD Data transfer Hold. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_DHOLD		(1 << 9)
/** SDMMC2_STAR_DATAEND Data transfer ended correctly. (data counter, DATACOUNT is zero and no errors occur). Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_DATAEND		(1 << 8)
/** SDMMC2_STAR_CMDSENT Command sent (no response required). Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_CMDSENT		(1 << 7)
/** SDMMC2_STAR_CMDREND Command response received (CRC check passed, or no CRC). Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_CMDREND		(1 << 6)
/** SDMMC2_STAR_RXOVERR Received FIFO overrun error or IDMA write transfer error. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_RXOVERR		(1 << 5)
/** SDMMC2_STAR_TXUNDERR Transmit FIFO underrun error or IDMA read transfer error. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_TXUNDERR		(1 << 4)
/** SDMMC2_STAR_DTIMEOUT Data timeout. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_DTIMEOUT		(1 << 3)
/** SDMMC2_STAR_CTIMEOUT Command response timeout. Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. The Command Timeout period has a fixed value of 64 SDMMC_CK clock periods. **/
#define SDMMC2_STAR_CTIMEOUT		(1 << 2)
/** SDMMC2_STAR_DCRCFAIL Data block sent/received (CRC check failed). Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_DCRCFAIL		(1 << 1)
/** SDMMC2_STAR_CCRCFAIL Command response received (CRC check failed). Interrupt flag is cleared by writing corresponding interrupt clear bit in SDMMC_ICR. **/
#define SDMMC2_STAR_CCRCFAIL		(1 << 0)

/**@}*/

/** @defgroup sdmmc2_icr ICR The SDMMC_ICR register is a write-only register. Writing a bit with 1 clears the corresponding bit in the SDMMC_STAR status register.
@{*/

/** SDMMC2_ICR_IDMABTCC IDMA buffer transfer complete clear bit Set by software to clear the IDMABTC flag. **/
#define SDMMC2_ICR_IDMABTCC		(1 << 28)
/** SDMMC2_ICR_IDMATEC IDMA transfer error clear bit Set by software to clear the IDMATE flag. **/
#define SDMMC2_ICR_IDMATEC		(1 << 27)
/** SDMMC2_ICR_CKSTOPC CKSTOP flag clear bit Set by software to clear the CKSTOP flag. **/
#define SDMMC2_ICR_CKSTOPC		(1 << 26)
/** SDMMC2_ICR_VSWENDC VSWEND flag clear bit Set by software to clear the VSWEND flag. **/
#define SDMMC2_ICR_VSWENDC		(1 << 25)
/** SDMMC2_ICR_ACKTIMEOUTC ACKTIMEOUT flag clear bit Set by software to clear the ACKTIMEOUT flag. **/
#define SDMMC2_ICR_ACKTIMEOUTC		(1 << 24)
/** SDMMC2_ICR_ACKFAILC ACKFAIL flag clear bit Set by software to clear the ACKFAIL flag. **/
#define SDMMC2_ICR_ACKFAILC		(1 << 23)
/** SDMMC2_ICR_SDIOITC SDIOIT flag clear bit Set by software to clear the SDIOIT flag. **/
#define SDMMC2_ICR_SDIOITC		(1 << 22)
/** SDMMC2_ICR_BUSYD0ENDC BUSYD0END flag clear bit Set by software to clear the BUSYD0END flag. **/
#define SDMMC2_ICR_BUSYD0ENDC		(1 << 21)
/** SDMMC2_ICR_DABORTC DABORT flag clear bit Set by software to clear the DABORT flag. **/
#define SDMMC2_ICR_DABORTC		(1 << 11)
/** SDMMC2_ICR_DBCKENDC DBCKEND flag clear bit Set by software to clear the DBCKEND flag. **/
#define SDMMC2_ICR_DBCKENDC		(1 << 10)
/** SDMMC2_ICR_DHOLDC DHOLD flag clear bit Set by software to clear the DHOLD flag. **/
#define SDMMC2_ICR_DHOLDC		(1 << 9)
/** SDMMC2_ICR_DATAENDC DATAEND flag clear bit Set by software to clear the DATAEND flag. **/
#define SDMMC2_ICR_DATAENDC		(1 << 8)
/** SDMMC2_ICR_CMDSENTC CMDSENT flag clear bit Set by software to clear the CMDSENT flag. **/
#define SDMMC2_ICR_CMDSENTC		(1 << 7)
/** SDMMC2_ICR_CMDRENDC CMDREND flag clear bit Set by software to clear the CMDREND flag. **/
#define SDMMC2_ICR_CMDRENDC		(1 << 6)
/** SDMMC2_ICR_RXOVERRC RXOVERR flag clear bit Set by software to clear the RXOVERR flag. **/
#define SDMMC2_ICR_RXOVERRC		(1 << 5)
/** SDMMC2_ICR_TXUNDERRC TXUNDERR flag clear bit Set by software to clear TXUNDERR flag. **/
#define SDMMC2_ICR_TXUNDERRC		(1 << 4)
/** SDMMC2_ICR_DTIMEOUTC DTIMEOUT flag clear bit Set by software to clear the DTIMEOUT flag. **/
#define SDMMC2_ICR_DTIMEOUTC		(1 << 3)
/** SDMMC2_ICR_CTIMEOUTC CTIMEOUT flag clear bit Set by software to clear the CTIMEOUT flag. **/
#define SDMMC2_ICR_CTIMEOUTC		(1 << 2)
/** SDMMC2_ICR_DCRCFAILC DCRCFAIL flag clear bit Set by software to clear the DCRCFAIL flag. **/
#define SDMMC2_ICR_DCRCFAILC		(1 << 1)
/** SDMMC2_ICR_CCRCFAILC CCRCFAIL flag clear bit Set by software to clear the CCRCFAIL flag. **/
#define SDMMC2_ICR_CCRCFAILC		(1 << 0)

/**@}*/

/** @defgroup sdmmc2_maskr MASKR The interrupt mask register determines which status flags generate an interrupt request by setting the corresponding bit to 1.
@{*/

/** SDMMC2_MASKR_IDMABTCIE IDMA buffer transfer complete interrupt enable Set and cleared by software to enable/disable the interrupt generated when the IDMA has transferred all data belonging to a memory buffer. **/
#define SDMMC2_MASKR_IDMABTCIE		(1 << 28)
/** SDMMC2_MASKR_CKSTOPIE Voltage Switch clock stopped interrupt enable Set and cleared by software to enable/disable interrupt caused by Voltage Switch clock stopped. **/
#define SDMMC2_MASKR_CKSTOPIE		(1 << 26)
/** SDMMC2_MASKR_VSWENDIE Voltage switch critical timing section completion interrupt enable Set and cleared by software to enable/disable the interrupt generated when voltage switch critical timing section completion. **/
#define SDMMC2_MASKR_VSWENDIE		(1 << 25)
/** SDMMC2_MASKR_ACKTIMEOUTIE Acknowledgment timeout interrupt enable Set and cleared by software to enable/disable interrupt caused by acknowledgment timeout. **/
#define SDMMC2_MASKR_ACKTIMEOUTIE		(1 << 24)
/** SDMMC2_MASKR_ACKFAILIE Acknowledgment Fail interrupt enable Set and cleared by software to enable/disable interrupt caused by acknowledgment Fail. **/
#define SDMMC2_MASKR_ACKFAILIE		(1 << 23)
/** SDMMC2_MASKR_SDIOITIE SDIO mode interrupt received interrupt enable Set and cleared by software to enable/disable the interrupt generated when receiving the SDIO mode interrupt. **/
#define SDMMC2_MASKR_SDIOITIE		(1 << 22)
/** SDMMC2_MASKR_BUSYD0ENDIE BUSYD0END interrupt enable Set and cleared by software to enable/disable the interrupt generated when SDMMC_D0 signal changes from busy to NOT busy following a CMD response. **/
#define SDMMC2_MASKR_BUSYD0ENDIE		(1 << 21)
/** SDMMC2_MASKR_TXFIFOEIE Tx FIFO empty interrupt enable Set and cleared by software to enable/disable interrupt caused by Tx FIFO empty. **/
#define SDMMC2_MASKR_TXFIFOEIE		(1 << 18)
/** SDMMC2_MASKR_RXFIFOFIE Rx FIFO full interrupt enable Set and cleared by software to enable/disable interrupt caused by Rx FIFO full. **/
#define SDMMC2_MASKR_RXFIFOFIE		(1 << 17)
/** SDMMC2_MASKR_RXFIFOHFIE Rx FIFO half full interrupt enable Set and cleared by software to enable/disable interrupt caused by Rx FIFO half full. **/
#define SDMMC2_MASKR_RXFIFOHFIE		(1 << 15)
/** SDMMC2_MASKR_TXFIFOHEIE Tx FIFO half empty interrupt enable Set and cleared by software to enable/disable interrupt caused by Tx FIFO half empty. **/
#define SDMMC2_MASKR_TXFIFOHEIE		(1 << 14)
/** SDMMC2_MASKR_DABORTIE Data transfer aborted interrupt enable Set and cleared by software to enable/disable interrupt caused by a data transfer being aborted. **/
#define SDMMC2_MASKR_DABORTIE		(1 << 11)
/** SDMMC2_MASKR_DBCKENDIE Data block end interrupt enable Set and cleared by software to enable/disable interrupt caused by data block end. **/
#define SDMMC2_MASKR_DBCKENDIE		(1 << 10)
/** SDMMC2_MASKR_DHOLDIE Data hold interrupt enable Set and cleared by software to enable/disable the interrupt generated when sending new data is hold in the DPSM Wait_S state. **/
#define SDMMC2_MASKR_DHOLDIE		(1 << 9)
/** SDMMC2_MASKR_DATAENDIE Data end interrupt enable Set and cleared by software to enable/disable interrupt caused by data end. **/
#define SDMMC2_MASKR_DATAENDIE		(1 << 8)
/** SDMMC2_MASKR_CMDSENTIE Command sent interrupt enable Set and cleared by software to enable/disable interrupt caused by sending command. **/
#define SDMMC2_MASKR_CMDSENTIE		(1 << 7)
/** SDMMC2_MASKR_CMDRENDIE Command response received interrupt enable Set and cleared by software to enable/disable interrupt caused by receiving command response. **/
#define SDMMC2_MASKR_CMDRENDIE		(1 << 6)
/** SDMMC2_MASKR_RXOVERRIE Rx FIFO overrun error interrupt enable Set and cleared by software to enable/disable interrupt caused by Rx FIFO overrun error. **/
#define SDMMC2_MASKR_RXOVERRIE		(1 << 5)
/** SDMMC2_MASKR_TXUNDERRIE Tx FIFO underrun error interrupt enable Set and cleared by software to enable/disable interrupt caused by Tx FIFO underrun error. **/
#define SDMMC2_MASKR_TXUNDERRIE		(1 << 4)
/** SDMMC2_MASKR_DTIMEOUTIE Data timeout interrupt enable Set and cleared by software to enable/disable interrupt caused by data timeout. **/
#define SDMMC2_MASKR_DTIMEOUTIE		(1 << 3)
/** SDMMC2_MASKR_CTIMEOUTIE Command timeout interrupt enable Set and cleared by software to enable/disable interrupt caused by command timeout. **/
#define SDMMC2_MASKR_CTIMEOUTIE		(1 << 2)
/** SDMMC2_MASKR_DCRCFAILIE Data CRC fail interrupt enable Set and cleared by software to enable/disable interrupt caused by data CRC failure. **/
#define SDMMC2_MASKR_DCRCFAILIE		(1 << 1)
/** SDMMC2_MASKR_CCRCFAILIE Command CRC fail interrupt enable Set and cleared by software to enable/disable interrupt caused by command CRC failure. **/
#define SDMMC2_MASKR_CCRCFAILIE		(1 << 0)

/**@}*/

/** @defgroup sdmmc2_acktimer ACKTIMER The SDMMC_ACKTIMER register contains the acknowledgment timeout period, in SDMMC_CK bus clock periods. A counter loads the value from the SDMMC_ACKTIMER register, and starts decrementing when the data path state machine (DPSM) enters the Wait_Ack state. If the timer reaches 0 while the DPSM is in this states, the acknowledgment timeout status flag is set.
@{*/


#define SDMMC2_ACKTIMER_ACKTIME_SHIFT		0
#define SDMMC2_ACKTIMER_ACKTIME_MASK		0x1ffffff
/** @defgroup sdmmc2_acktimer_acktime ACKTIME Boot acknowledgment timeout period This bit can only be written by firmware when CPSM is disabled (CPSMEN = 0). Boot acknowledgment timeout period expressed in card bus clock periods.
@{*/
/**@}*/


/**@}*/

