grevaillot/svd_tools/headers/STM32H7x5_CM4/sdmmc2.h
/** @defgroup sdmmc2_idmactrlr IDMACTRLR The receive and transmit FIFOs can be read or written as 32-bit wide registers. The FIFOs contain 32 entries on 32 sequential addresses. This allows the CPU to use its load and store multiple operands to read from/write to the FIFO.
@{*/

/** SDMMC2_IDMACTRLR_IDMABACT Double buffer mode active buffer indication This bit can only be written by firmware when DPSM is inactive (DPSMACT = 0). When IDMA is enabled this bit is toggled by hardware. **/
#define SDMMC2_IDMACTRLR_IDMABACT		(1 << 2)
/** SDMMC2_IDMACTRLR_IDMABMODE Buffer mode selection. This bit can only be written by firmware when DPSM is inactive (DPSMACT = 0). **/
#define SDMMC2_IDMACTRLR_IDMABMODE		(1 << 1)
/** SDMMC2_IDMACTRLR_IDMAEN IDMA enable This bit can only be written by firmware when DPSM is inactive (DPSMACT = 0). **/
#define SDMMC2_IDMACTRLR_IDMAEN		(1 << 0)

/**@}*/

/** @defgroup sdmmc2_idmabsizer IDMABSIZER The SDMMC_IDMABSIZER register contains the buffers size when in double buffer configuration.
@{*/


#define SDMMC2_IDMABSIZER_IDMABNDT_SHIFT		5
#define SDMMC2_IDMABSIZER_IDMABNDT_MASK		0xff
/** @defgroup sdmmc2_idmabsizer_idmabndt IDMABNDT Number of transfers per buffer. This 8-bit value shall be multiplied by 8 to get the size of the buffer in 32-bit words and by 32 to get the size of the buffer in bytes. Example: IDMABNDT = 0x01: buffer size = 8 words = 32 bytes. These bits can only be written by firmware when DPSM is inactive (DPSMACT = 0).
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc2_idmabase0r IDMABASE0R The SDMMC_IDMABASE0R register contains the memory buffer base address in single buffer configuration and the buffer 0 base address in double buffer configuration.
@{*/


#define SDMMC2_IDMABASE0R_IDMABASE0_SHIFT		0
#define SDMMC2_IDMABASE0R_IDMABASE0_MASK		0xffffffff
/** @defgroup sdmmc2_idmabase0r_idmabase0 IDMABASE0 Buffer 0 memory base address bits [31:2], shall be word aligned (bit [1:0] are always 0 and read only). This register can be written by firmware when DPSM is inactive (DPSMACT = 0), and can dynamically be written by firmware when DPSM active (DPSMACT = 1) and memory buffer 0 is inactive (IDMABACT = 1).
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc2_idmabase1r IDMABASE1R The SDMMC_IDMABASE1R register contains the double buffer configuration second buffer memory base address.
@{*/


#define SDMMC2_IDMABASE1R_IDMABASE1_SHIFT		0
#define SDMMC2_IDMABASE1R_IDMABASE1_MASK		0xffffffff
/** @defgroup sdmmc2_idmabase1r_idmabase1 IDMABASE1 Buffer 1 memory base address, shall be word aligned (bit [1:0] are always 0 and read only). This register can be written by firmware when DPSM is inactive (DPSMACT = 0), and can dynamically be written by firmware when DPSM active (DPSMACT = 1) and memory buffer 1 is inactive (IDMABACT = 0).
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc2_fifor FIFOR The receive and transmit FIFOs can be only read or written as word (32-bit) wide registers. The FIFOs contain 16 entries on sequential addresses. This allows the CPU to use its load and store multiple operands to read from/write to the FIFO.When accessing SDMMC_FIFOR with half word or byte access an AHB bus fault is generated.
@{*/


#define SDMMC2_FIFOR_FIFODATA_SHIFT		0
#define SDMMC2_FIFOR_FIFODATA_MASK		0xffffffff
/** @defgroup sdmmc2_fifor_fifodata FIFODATA Receive and transmit FIFO data This register can only be read or written by firmware when the DPSM is active (DPSMACT=1). The FIFO data occupies 16 entries of 32-bit words.
@{*/
/**@}*/


/**@}*/
